app/controllers/notes_controller.rb

	def index
		@notes = Note.where(user_id: current_user)
---
SELECT "notes".* FROM "notes" WHERE "notes"."user_id" = 1

	def create
		@note = current_user.notes.build(note_params)

		if @note.save
---
INSERT INTO "notes" ("title", "content", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "Note for User"], ["content", "Exemple for user"], ["created_at", "2018-05-22 18:08:50.868790"], ["updated_at", "2018-05-22 18:08:50.868790"], ["user_id", 1]]

	def find_note
		@note = Note.find(params[:id])
---
SELECT  "notes".* FROM "notes" WHERE "notes"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]